books = [
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1966},
    {"title": "Орлеан", "author": "Лия Стэффи", "year": 2021},
    {"title": "Лев, Колдунья и Платяной шкаф", "author": "Льюис, Клайв Стейплз", "year": 1950},
    {"title": "Гарри Поттер и Тaйная комната", "author": "Джоан Кэтлинг Роулинг", "year": 1998},
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869}
]

for i, book in enumerate(books):
    print("-" * 30 + f" Книга {i+1} " + "-" * 30)
    print(f"Название: {book["title"]}, Автор: {book["author"]},")
    print("-" * 30 + f" {book["year"]} " + "-" * 30 + "\n")